tutorials/bayesianOptimization/Bayesian Optimization of chip cooling/chip_cooling_Rotated/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 29.94734;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            omegaWallFunction;
	value		uniform 0;
    }

    bottom
    {
        type            omegaWallFunction;
	value		uniform 0;
    }

    side1
    {
        type            omegaWallFunction;
	value		uniform 0;
    }
    side2
    {
        type            omegaWallFunction;
	value		uniform 0;
    }
    solid
    {
        type            omegaWallFunction;
	value		uniform 0;
    }
}


// ************************************************************************* //
